[{"title":"Our Beliefs","body_content":"### GOD\n\nWe believe that there is one, and only one ,true and living God, and that He is revealed in the unity of the Godhead. We believe that God the Father, God the Son, and God the Holy Spirit are the three personalities of the one God. We believe Jesus Christ is God the Son. (Deut. 4:35; Matt. 28:19; II Cor. 13:14; 1 John 5:7. John 1:1-3, 1 Timothy 2:3-4).\n\n### THE SCRIPTURES\n\nWe believe in the verbal, plenary inspiration of the Scriptures; that the whole Bible from Genesis 1:1 to Revelation 22:21 was written by men supernaturally and verbally inspired, that it is inerrant and infallible, and that it is a perfect treasure of Holy instruction. We believe that the Bible is our sole rule for faith and practice. We use the King James Bible in our services. (II Tim. 3:16, 17; 1 Cor. 2:13; II Peter 1:21).\n\n### THE FALL OF MAN\n\nWe believe that man was created in a state of holiness, under the law of his Maker; but by voluntary transgression fell from that holy and happy state; resulting in all mankind now being sinners, not by constraint, but choice; that man is by nature utterly void the holiness required by the law of God, wholly given to the gratification of the world, of Satan, and of his own sinful passions, and is therefore under just condemnation to eternal ruin, without defense or excuse (Gen. 3:6-24; Ps. 51:5; Isa. 53:6; Rom. 3:10-23; 5:12; Eph. 2:1-3).\n\n### SALVATION\n\nWe believe that the salvation of sinners is wholly of grace; through the working of the Son of God, who [by the appointment of the Father, freely] took upon Him our nature, yet without sin; honored the [divine] law by His personal obedience, and made atonement for our sins by His death; being risen from the dead He is now enthroned in heaven, where He now makes intercession for the saved. Anyone who will exercise repentance toward God and faith in the Lord Jesus Christ will be saved, and this salvation is based wholly on the grace of God . the Blood of Christ, and is completely apart from man’s works (Isa. 53:1-12; 2 Cor. 5:21; Eph. 2:8, 9; Phil. 2:5-11; Titus 3:5; 1 Pet. 1:18, 19; Acts 20:20, 21; Rom. 10:17).\n\n### THE CHURCH\n\nWe believe that the New Testament church was founded by Jesus Christ during His personal ministry on earth. We believe in the perpetuity of the church; that there have been New Testament churches on the earth since His personal, earthly ministry and that they will continue to be here until He returns. The New Testament church is a local, visible body of baptized believers covenanted together to carry out the Great Commission; observe the ordinances Christ has placed in the church and maintain discipline within the body. Its only proper officers are Pastors, and Deacons, whose qualifications, claims, and duties are defined in the Epistles to Timothy and Titus. Each local church is autonomous, recognizing Jesus only as her Head, and the Bible only as her rule for faith and practice. The church is the pillar and the ground of truth (Matt. 16:18; 18:165-19; 28:19,20; Acts 2:41-47; Eph. 5:23; Col. 1:18; 1 Tim. 3:15).\n","featured_image":[{"id":"attX30JrgeL6uPBzg","url":"https://dl.airtable.com/VwsDHaiST9eg9BQKZrkt_Screen%20Shot%202016-06-23%20at%204.19.47%20PM.png","filename":"Screen Shot 2016-06-23 at 4.19.47 PM.png","size":339529,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/GacvPX9QLiGT4UT0nqwQ_small_Screen%20Shot%202016-06-23%20at%204.19.47%20PM.png","width":64,"height":36},"large":{"url":"https://dl.airtable.com/ICOtnQSyeF5X3vxxa8PA_large_Screen%20Shot%202016-06-23%20at%204.19.47%20PM.png","width":512,"height":346}}}],"published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Our Location","body_content":"### Get Directions to Our Church\n\n**Option 1:** GPS: Enter the church address into your GPS and meet us here!\n\n5267 Sound Ave\nRiverhead, NY 11901\n\n**Option 2:** Smart phone or Tablet (click this link to Google maps)\n\n**Option 3:** Old school, but still reliable: (follow these directions)\n\n**From the West:** (Nassau county, Western Suffolk, and NYC)\n\nLong Island Expressway (495) east to exit 71. At the stop sign turn left onto Edwards Avenue and head North, proceed about 2 miles and turn right onto Sound ave, proceed about 4 miles. Community Baptist Church is on the right hand side (on the corner of Sound ave, and Church lane).\n\n**From the East:** (North Fork of Long Island)\n\nMiddle Road West toward NYC. Proceed until Middle Road merges with Sound avenue and continue straight. Proceed about 2 miles to Community Baptist Church on the left hand side. (corner of Sound avenue and Church lane)\nFrom the south Fork: (Hamptons, Shinnecock, Montauk)\n\nSunrise Hwy (27) west toward NYC. Take exit 65 north (Hwy 24,Flanders Rd), proceed North West about 5 miles and turn right on Cross River Drive (105 North), continue on this path about 3 miles until you reach Sound ave. Turn right onto Sound avenue, and follow it about 1 ½ miles. Community Baptist Church is on the right hand side (the corner of Sound avenue and Church Lane).\nFrom the South Shore: (West Hampton, Moriches, Patchogue, Bayport, and points West)\n\nSunrise Hwy (27) East toward Montauk. Take exit 63 N (Riverhead Rd) and proceed about ¾ mile till it stops at Quogue-Riverhead Rd. Turn left onto Quoge-Riverhead Rd and proceed North about 2 miles to Cross River Drive (105), continue on this path about 3 miles until you reach Sound ave. Turn right onto Sound avenue, and follow it about 1 ½ miles. Community Baptist Church is on the right hand side (the corner of Sound avenue and Church Lane).","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Our Pastor","body_content":"Our Pastor is Josh Fryman. He and his wife, Jen, have been married for 15 years. They have two daughters, Madison and Molly.\nThe Frymans were used by the Lord to start our church in 2010.  After many blessings and some growth, in September of 2012 our church was officially organized, and Josh was voted in as our pastor. He loves the Lord, his family, and our church. \nFeel free to email him directly at joshuafryman@yahoo.com.\n\n\n","featured_image":[{"id":"attry0CqusTPZ7ZME","url":"https://dl.airtable.com/pR226eXzTgCAzka89rdK_Screen%20Shot%202016-06-23%20at%204.18.51%20PM.png","filename":"Screen Shot 2016-06-23 at 4.18.51 PM.png","size":281907,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/rdhyzLLXQgaKJvRXY7XP_small_Screen%20Shot%202016-06-23%20at%204.18.51%20PM.png","width":36,"height":36},"large":{"url":"https://dl.airtable.com/UFOJPQ2PTN21BXoz79jK_large_Screen%20Shot%202016-06-23%20at%204.18.51%20PM.png","width":366,"height":364}}}],"published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Our People","body_content":"At Community Baptist Church, we have some of the warmest, and most loving people you will ever meet.  We invite you to come and form friendships that will last a lifetime, as we learn the Bible and worship The Lord together.\n","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0}]
