[{"title":"Sample Blog Post","body_content":"Proverbs 27:5 _“Open rebuke is better than secret love.”_\n\nWhen I was a teenager my Nephew Ronny Hicks was just a baby. When I would go places with his mom Karen and his dad Jamie (my big brother) I would often sit with Ronny.\n\nWhen he was around 3yrs old he would ask for certain things or be getting into certain things and I'd have to tell him \"No Ronny.\" One day he says to me in cute kid speech of improper grammar: \"Doe tell me no unk Shaw\". Nevertheless, clearly understood as \"Don't tell me no Uncle Sean.\"\n\nHe was at the age that anything he wanted was good, and anyone keeping him from it was bad.\n\nThat cute story reminds me of something not so cute about our society today. For the past 50-60yrs we have seen America changing. What was once found to be abominable and shameful is now admirable and acceptable.\n\nDrunkenness, drug use, fornication, divorce, children born out of wedlock, abortion, profanity, pornography, immorality and now homosexuality is commonly accepted practices.\n\nAs a Bible believing Christian I adhere to the Word of God and as a preacher I proclaim the Word of God. Once, our society respected preachers because it was commonly understood that \"they watch for your souls, as they that must give account,\" unto God for you.\n\nHowever today as our society continues its tailspin into moral and spiritual depravity there is an increasing anger against the Lord, His Word and His preachers with a resounding cry of \"Don't tell me no!\"\n\nLook friends, there is a real hell with real people in it. There is coming a day when all will stand before God. If you die in your sins unforgiven and unchanged you will go to a place where the fire is never quenched and worm dieth not, where there will be weeping, wailing and gnashing of teeth for an ETERNITY!\n\nTelling people \"no\" to things that you know will destroy them is not hate, but saying nothing is.\n\nGod is love. Not desiring that any should perish but that all should come to repentance. Christ was sent to die in your place. God is love,yes, but He is also holy and He is righteous and He must judge sin.\n\nEither your sin has been placed on Christ account or you still owe a sin debt that you can never pay.\n\nThe Lord wants to save you from your sin, not keep you in it. He wants to liberate you from sin, not give you liberty to sin.\n\nRegardless of what you have done, Christ is willing to save you just as you are, but not to keep you as you are.","categories":["Articles"],"author":["rec2UdcKJCDJu9zs1"],"date_added":"2015-09-02","published":true,"author_name":["Pastor Seth Alcorn"],"ten_minutes":0,"updated_or_created_ten_minutes":0}]
