[{"title":"Evangelism and Muhammad Ali","body_content":"\"I'm the most recognized and loved man that ever lived cuz there weren't no satellites when Jesus and Moses were around...\"   Most people could figure out pretty easily who said that quote. (No, it wasn't an evangelist.)  If you're a boxing fan you wouldn’t need to guess, you would know.  It was said by \"the greatest\", Muhammad Ali.\n\nPeople, Ali included, called him \"the greatest\" because of his superior athletic ability, three heavyweight championships, sharp wit, and an ego that was as undisputed as some of his victories in the ring. Also, there was his kindness.  Not many could match Ali when it came to benevolence.  As dominating as he was in the ring, he was generous outside of it.\nSo, what does all this have to do with theology?\n  \nHere are several questions that have come up as the dust has settled down over the news of Ali's passing earlier this month.  They are:\n\n* Was Muhammad Ali a man of faith?\n* Is Muhammad Ali in Heaven?\n* Why do so many people want \"good people\" to go to Heaven?\n\n### So, was Ali a man of faith?\n\nIn short, yes, if \"of faith\" simply means he was religious.  But the real question, and the one that effected his eternity, is **\"was he a man of The Faith?\"**   Hebrews 11 teaches us that real faith, faith that is a gift from God, is a substance; it is literally the evidence of things not seen. In Jude we find the exhortation to contend for the faith. That doesn’t mean we are to contend for the right to believe; it means there is a specific faith that transcends merely a strong confidence, and it's worth defending. When you think about it, every single person that is able to reason, atheists included, are people \"of faith\".  Don’t let anyone say they are not either.  Many people, and most atheists, will say \"I don’t have faith; I have confidence.\" That feels good to them because \"faith\" seems like a religious term; but confidence means \"with faith\".(con fide)  So there is no debate whether or not all of us have faith; the real issue is what, or who, our faith is in.  Cassius Clay changed his name to Muhammad Ali because he believed the teachings of Elijah Muhammad and Islam.  By his own words he cited racial, cultural, and social reasons for the change of his faith.  \n\nTragically, this is no evidence of the faith taught in Scriptures.  The faith that is revealed in the Bible is in Jesus Christ, alone.  This is significant because Jesus Christ did not come as just a prophet (as Islam teaches), He did not come as a political dissident or a radical ready to change society.  He came to live so that He might die. He came to seek and save sinners, and \"sinners\" includes every one of us, no matter how great we or the world thinks we are. This is why we don't just preach Christ; we preach Christ crucified.  The cross is where the ultimate victory was won over sin. Jesus said of Himself in John 14, He is the Way, the Truth, and the Life.  Faith in Jesus Christ, as He is revealed in Scripture, is the faith that comes from God.  Being a person of faith means nothing, but being a person of the faith means everything.\n\n### Is Ali in Heaven?  \n\nI'll just refer you to the words of Christ, again found in John 14: \"no man cometh unto the Father, but by me.\"   Remember, Jesus never exaggerated or said the wrong thing. So, when He said \"No man\", He meant it.  When He said \"cometh to the Father\", He meant it.  And when He said \"but by me\", He meant it.  No exceptions will be made for you, me, or anyone.\nWhy do so many people want \"good people\" to go to Heaven?  Jim Bakker recently said Muhammad Ali is in Heaven \"sparring with Jesus\".  First, Jim Bakker is a heretic and we ought not be surprised a man like him would be so flippant.  \n\n### Why do so many people want \"good people\" to go to Heaven?\n\nBut why the need to make it seem like Ali became a Christian?  Because people whose faith is in their own faith seem to find validation in celebrities being \"Christian\" too.  Don’t be like that.\n\nThe bottom line is that Muhammad Ali was a kind, benevolent, and talented man who, to the best of our knowledge, trusted his soul to Allah.  May God use this to motivate us to be better and clearer in our evangelism.","featured_image":[{"id":"attxvsiWIWO3hgKFE","url":"https://dl.airtable.com/MD3tTi1HQDyKYs3PHbBT_Evangelism.jpg","filename":"Evangelism.jpg","size":1170296,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/2b136D8fSniAzfLXptf0_small_Evangelism.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/R5FANXnxQwm3H3RxRblR_large_Evangelism.jpg","width":512,"height":512}}}],"categories":["Articles"],"author":["recUAuFWm7IbOvCHM"],"date_added":"2016-07-28","published":true,"author_name":["Pastor Josh Fryman"]}]
