[{"name":"AWANA","header_image":[{"id":"attnwJEE1O2EWXwZY","url":"https://dl.airtable.com/WvhlR3cXRKGiGs3C4DGu_awana.jpg","filename":"awana.jpg","size":8078,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/DTMoQIFiSY6A6AASdLRL_small_awana.jpg","width":69,"height":36},"large":{"url":"https://dl.airtable.com/47lPGjscSKOK1AS8MzHg_large_awana.jpg","width":228,"height":119}}}],"meeting_place":"The Church","body_content":"AWANA has been an organization since 1950. Its sole purpose is to help local churches get the Word of God into the hearts of children. The 2 fold goal of AWANA is Scripture memorization and discipleship. The ages for our program are 5-12. ","Church Events":["recDAGIqoL76cbxjg","rec5pGU8X0FPdRpnx","recPWUTkQfpjkZT6e","recKn7RzVpMfPm3qP","recnYo70I3DvP8K0g"],"show_on_home_page":true,"published":true},{"name":"Nursing Home","meeting_place":"The Church","body_content":"Starting in October we will begin a Nursing Home Ministry involving several of our local nursing homes and assisted living facilities.\n-Our mission is to show the love of Christ to the residents by our visit,love for them and by sharing the Gospel as led by the Holy Spirit.\n- Our group will meet monthly at the church to review what we have done and to access its effectiveness.\n- Our visits with the residents will include:\n   *Spending time with them, letting them talk to us and we with them.\n   * Assisting with crafts as directed by the Activity Directors\n   * Sharing the musical gifts from our church\n   * Being companions as they go on \"Field Trips\"\n   * A possible pet therapy person in association with another local assembly\n   * Spending time reading to those who's eye sight has failed\n- Another part of our ministry is to be a helper for our Pastor.\n   * Two days a week someone will be assigned to this \n      responsibility. This may be visiting the sick or other things \n      that would be helpful to him\nPlease Pray that we will honor the Lord Jesus in our efforts..\n  \n","Church Events":["recvYqvwAMWB5Fht4"],"show_on_home_page":true,"published":true},{"name":"Radio","body_content":"For over 50 years the Sunday Morning Miracles Broadcast has been a blessing to many.  This ministry was started by former pastor Carlton Blackenship, continued by Pastor Jerry Young and is carried on today by Pastor Seth Alcorn, under the name Knowing Him.  \n\n\nEvery Sunday morning at 8:30 am many people in the Front Royal area listen to the broadcast.  You may tune in on 95.3 FM, TheRiver, local Comcast Cable channel 15, or theriver953online.com.   Shenandoah County residents many tune in to WOTC 88.3 FM on  Monday mornings at 11:00 am.","published":true},{"name":"Sunday School","header_image":[{"id":"attmjfp5PHje8lgSS","url":"https://dl.airtable.com/DyUIrgHTS3m2n9rGyxWh_Sunday_School.jpg","filename":"Sunday_School.jpg","size":84259,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/xs4WTHi0S9qM3Eam5rMS_small_Sunday_School.jpg","width":67,"height":36},"large":{"url":"https://dl.airtable.com/V1QcXgYMQS2WaItdBfk0_large_Sunday_School.jpg","width":512,"height":512}}}],"meeting_place":"The Church","group":"Everyone","body_content":"Sunday school is Sunday morning at 9:45 am.  Our teachers are experienced and love the Lord Jesus Christ. From the nursery age to the Senior Saints we have a class for all ages.","meeting_time":"Sunday mornings at 9:45","published":true},{"name":"Van","header_image":[{"id":"attDnOC8BirsSoSQD","url":"https://dl.airtable.com/ob0cqocrRWuE3J8SMPJA_2016-09-21%2011.50.22.png","filename":"2016-09-21 11.50.22.png","size":982694,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/RQsz23VmQ1echZZxJUMi_small_2016-09-21%2011.50.22.png","width":83,"height":36},"large":{"url":"https://dl.airtable.com/OOIj6Vt7SFCa63m3bsmo_large_2016-09-21%2011.50.22.png","width":512,"height":481}}}],"body_content":"Each week we pick up children and bring them to our services. For a ride to church please call or email us.","published":true},{"name":"Youth 4 Truth","body_content":"At Rivermont we seek to give our teenagers a good balance between having fun and learning the Word of God. We have special times devoted for teaching such as Sunday school, Wednesday night Bible study, Summer camp, and our  monthly discipleship group. We also have lots of fun together on monthly outings. We normally have outings such as DC United soccer games, paintball, scavenger hunts and many others. ","published":true}]
