[{"name":"AWANA","body_content":"AWANA has been an organization since 1950. Its sole purpose is to help local churches get the Word of God into the hearts of children. The 2 fold goal of AWANA is Scripture memorization and discipleship. The ages for our program are 5-12. ","published":true},{"name":"Nursing Home","published":true},{"name":"Radio","body_content":"For over 50 years the Sunday Morning Miracles Broadcast has been a blessing to many.  This ministry was started by former pastor Carlton Blackenship, continued by Pastor Jerry Young and is carried on today by Pastor Seth Alcorn, under the name Knowing Him.  \n\n\nEvery Sunday morning at 8:30 am many people in the Front Royal area listen to the broadcast.  You may tune in on 95.3 FM, TheRiver, local Comcast Cable channel 15, or theriver953online.com.   Shenandoah County residents many tune in to WOTC 88.3 FM on  Monday mornings at 11:00 am.","published":true},{"name":"Sunday School","header_image":[{"id":"attmjfp5PHje8lgSS","url":"https://dl.airtable.com/DyUIrgHTS3m2n9rGyxWh_Sunday_School.jpg","filename":"Sunday_School.jpg","size":84259,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/xs4WTHi0S9qM3Eam5rMS_small_Sunday_School.jpg","width":67,"height":36},"large":{"url":"https://dl.airtable.com/V1QcXgYMQS2WaItdBfk0_large_Sunday_School.jpg","width":512,"height":512}}}],"meeting_place":"The Church","group":"Everyone","body_content":"Sunday school is Sunday morning at 9:45 am.  Our teachers are experienced and love the Lord Jesus Christ. From the nursery age to the Senior Saints we have a class for all ages.","meeting_time":"Sunday mornings at 9:45","published":true},{"name":"Van","body_content":"Each week we pick up children and bring them to our services. For a ride to church please call or email us.","published":true},{"name":"Youth 4 Truth","body_content":"At Rivermont we seek to give our teenagers a good balance between having fun and learning the Word of God. We have special times devoted for teaching such as Sunday school, Wednesday night Bible study, Summer camp, and our  monthly discipleship group. We also have lots of fun together on monthly outings. We normally have outings such as DC United soccer games, paintball, scavenger hunts and many others. ","published":true}]
