[{"Section_title":"Visiting Our Church","Content":"Finding a church home is one of the most important decisions that you will ever make. What should you look for in a church? There is no doubt programs and facilities are  important to us all but should not be our main focus. What is most important about a church is does that community of people called Christians truly represent what it means to be ruled by Jesus Christ and live a life pleasing to Him. \r\n \r\n\r\nFor that to be the case the church must be committed to preaching and living Scriptures. At Rivermont Baptist Church we desire to be a people of the Bible, the Word of God. We hope you will find that experience in visiting with us at Rivermont. "},{"Section_title":"Our Services","Content":"You are always welcome to join us for any one of our services. Here is some basic information about them: \n\n### Sunday Services\n\nWe have services every Sunday Morning at 11:00 AM and every Sunday Evening at 6:00 PM. We sing Christian music, pray together, and our pastor brings a message from the Bible. Our services rarely last longer than one hour and fifteen minutes.\n\n### Sunday School\n\nWe meet every Sunday at 9:45 AM for Sunday School. We have Sunday School classes for all ages and stages of life. Please check out our ministries page for more information about a Sunday School class.\n\n### Midweek Prayer Meeting\n\nEvery Wednesday at 7:00 PM we meet together for a time of fellowship and prayer. Our Wednesday services are more casual. Pastor brings a very brief message, we take prayer requests and pray for the needs of our church, community, and world. We have nursery for infants to age 4. We also have other programs for our young people ages 5 through 12th grade. For more information on our programs please see our ministry pages for Youth 4 Truth and AWANA.\n"},{"Section_title":"For the Kids","Content":"### Nursery\n\nNursery is provided for all of our services. We strive to create a wonderful environment for your little ones. Our Nursery is well staffed, and clean. Parents are always welcome.\n\n### Children’s Church\n\nDuring our Sunday Morning service we provide a children’s church for kids from preschool through th grade. These kids sit in the “regular” service until right before the message, and then go to their respective children’s church group for an age appropriate message and activities.\n\n### Youth Group\n\nWe have a youth group for teenagers. They meet together during Sunday School, Wednesday nights, and during monthly activities.\n"},{"Section_title":"FAQs","Content":" Below are answers to some of the most common questions people often ask before visiting a church?\n\n### Is there a dress code?\n\nWhile many of the people in our church “dress up” - there is no dress code at the church. We don’t care what you wear, only that you are here. \n\n#### What is your music like?\n\nWe base our philosophy of music on the Word of God. In Colossians 3:16, we learn the importance of our music solely honoring Christ and teaching us the truths of Scriptures. Our worship style is mainly traditional. We do congregational hymns, choir numbers, and solo's, and we use many different genres of music that are played in a conservative fashion by piano or instrumental tracks. .\n\n#### How long does our service last?\n\nOur services last between 60 to 75 minutes.\n\n#### Am I expected to take part in an offering?\n\nNo! Our offering is for our members and regular attenders. When the offering is passed please just let it go on by.\n\n#### How do I find the church?\n\nThe church is located off Route 619 at 575 Catlett Mountain Road.  Please use the map below for directions. "}]
